docs/bill-of-material_ontology.md
```mermaid
classDiagram 
   class BillOfMaterial~bill-of-material~{
       quantityMeasure float
       quantityUnit string
       validityPeriodEnd date
       validityPeriodStart date
   } 
   class BusinessPartner~common~{
   } 
   class ConceptualObject~core~{
   } 
   class PhysicalObject~core~{
   } 
   BillOfMaterial --> BusinessPartner : assembler
   BillOfMaterial --> PhysicalObject : assembly
   BillOfMaterial --> ConceptualObject : assemblyConcept
   BillOfMaterial --> PhysicalObject : component
   BillOfMaterial --> ConceptualObject : concept
   PhysicalObject --> BillOfMaterial : hasBom
   BillOfMaterial --> BusinessPartner : supplier
   BillOfMaterial --|> ConceptualObject

```  
